[
    {
        "Course":"Foundation in Chinese Communication",
        "Degree":"foundation",
        "Semester":3,
        "Duration(Year)":1.0,
        "Course Fee(RM)":11700,
        "Min Entry Requirement":"SPM certificate with 5 credits including Chinese OR UEC 3 credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Upon completion of the programme, students may proceed to the bachelor’s degree programmes offered by Department of Chinese Language and Literature, Department of Guidance and Counselling, Department of Education.",
        "Y1 module":"The modules include Computer Applications, The Art of Speaking, Current Affairs Analysis, Introduction to Multiculturalism, History of Malaysia, Critical Thinking and Problem-Solving Skills, Selected Writings in Chinese Essays, Training in Chinese Reading and Writing, Forum on Chinese Topics, EQ & Life, Intermediate English, Introduction to Academic Writing, Chinese Writing, Foundation of Social Science, Literature and Art, Interpersonal Communication, Advanced Chinese Language, and Physical Education.",
        "Y2 module":" ",
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Foundation in Arts",
        "Degree":"foundation",
        "Semester":3,
        "Duration(Year)":1.0,
        "Course Fee(RM)":11700,
        "Min Entry Requirement":"Sijil Pelajaran Malaysia (SPM) with 5 credits (Grade C), OR O-Level with Grade C in 5 subjects, OR Unified Examination Certificate (UEC) with Grade B in 3 subjects, OR Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Upon completing this program, students may advance to pursue a variety of Bachelor’s degrees at our university college, including the Bachelor of Arts (Honours) in Chinese Language & Literature, Bachelor in Early Childhood Education (Honours), Bachelor of Education (Teaching Chinese as a Second Language) (Honours), Bachelor of Arts (Honours) in Counselling, Bachelor of Arts (Honours) in Business Administration, Bachelor of Business in Marketing (Honours), Bachelor of Science (Honours) in Finance and Accounting, Bachelor of Computer Science (Honours) in Software Engineering, Bachelor of Information Technology (Cyber Security) with Honours, Bachelor of Arts (Honours) in Visual Communication, Bachelor of Arts (Honours) in Media and Communication Studies, Bachelor of Healthcare Management (Honours), and Bachelor of Law Enforcement (Honours).",
        "Y1 module":"The core courses include Introduction to Sociology, Introduction to Information Technology, Critical Thinking and Problem-Solving Skills, Introduction to Management, Introduction to Social Sciences, Personal Development Skills, Presentation Skills, Introduction to Entrepreneurship, Introduction to Psychology, Writing and Research Skills, and Academic English.",
        "Y2 module":" ",
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Visual Arts",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.5,
        "Course Fee(RM)":36000,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Visual artist, Sculptors, Potters, Ceramicist, Printmaker, Designer, Illustrator, Art entrepreneur, Art educator, Art administrator, Art promoter, Art consultant, Gallery management, Curator, Window Display Artist, Exhibition Designer",
        "Y1 module":"The core modules include Contextual Studies, History of Art & Design, Colour Studies, 2- and 3-Dimensional Designs, Computer Graphics, Introduction to Digital Photography, Visual Arts Study, Drawing 1 and 2, Painting Studio 1, Introduction to Ceramics, and Printmaking 1 and 2.",
        "Y2 module":"The core modules include Contextual Studies, Visual Culture, Project Research, Digital Photography, Visual Arts Study, Painting Studio 2 and 3, Ceramics 1 and 2, Chinese Art, Experimental Art Process, Professional Development, and Industrial Training.",
        "Y3 module":"The core modules include Visual Arts Study, Visual Arts Final Project, Ceramic 3, Professional Development, Professional Practice, and Art Entrepreneurship, along with selected program modules.",
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Graphic Design",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.5,
        "Course Fee(RM)":38000,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Career opportunities include roles such as Creative Director, Advertising Art Director, Editorial Designer, Corporate Identity Designer, Print Production Designer, Packaging Designer, Graphic Designer, Design Educator, Web Designer, Copywriter, Photographer, and Digital Illustrator.",
        "Y1 module":"Contextual Studies, History of Art & Design, Colour Studies, 2 & 3-Dimensional Designs, Drawing 1, Drawing 2, Graphic Design Fundamentals, Introduction to Graphic Design, Typography, Technical Skills, Computer Graphics 1, Computer Graphics 2, Introduction to Digital Photography",
        "Y2 module":"Contextual Studies, Visual Culture, Visual Communication, Project Research, Graphic Communication, Brand Identity, Principles of Advertising, Packaging Design and Technology, Advertising Design, Digital Design Exploration, Digital Photography, Motion Graphics, Digital Illustration, Web Design, Elective Course, Introduction to Ceramics",
        "Y3 module":"Graphic Communication, Publication Design and Electronic Pre-Press, Professional Development, Industrial Training, Entrepreneurship, Personal Portfolio Development, Final Design Project, Selected programme modules",
        "Unnamed: 10":" "
    },
    {
        "Course":"Diploma in Interior Design",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.5,
        "Course Fee(RM)":38000,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Career opportunities include roles such as Junior Interior Designer, Interior & Spatial Designer, Production Designer, Design Consultant, Furniture Designer, Exhibition Designer, Lighting Designer, Kitchen Designer, Model Maker, Set, Stage & Theatre Designer, Colour Consultant, Material Specialist, 3D Visualizer, Interior Draughtsman, Merchandise Coordinator, Design & Sales Associate, and Administrative & Design Assistant.",
        "Y1 module":"core modules include Design, Creative Work by Research Method, 2 & 3 Dimensional Studies, Color Studies, Design Studio - Residential, Knowledge of Material, Visual Research, Material Studies, Introduction to Ceramic, Technology and Building Services, Building Technology 1, Visual Communication, Drawing 1, Computer Graphic, Design Communication 1, People & Environment, History of Art & Design, and History of Architecture 1, along with General & HEP courses.",
        "Y2 module":"core modules include Design, Creative Work by Research Method, Design Studio - Commercial, Design Studio - Institutional & Exhibition, Furniture Design 1, Furniture Design 2, Technology and Building Services, Building Technology 2, Building Services, Visual Communication, Design Communication 2, Introduction to Digital Photography, Computer-Aided Design 1, Computer-Aided Design 2, People & Environment, History of Architecture 2, Professional Practices, Internship, and Project Research, along with General & HEP courses.",
        "Y3 module":"core modules include Design, Creative Work by Research Method, Final Design Project, Professional Practices, Professional Practice, and Bill of Quantities & Specifications.",
        "Unnamed: 10":" "
    },
    {
        "Course":"Diploma in Digital Media Design",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.5,
        "Course Fee(RM)":38000,
        "Min Entry Requirement":"The minimum entry requirements include having a Sijil Pelajaran Malaysia (SPM) with at least 3 credits in any subjects, or a Unified Examination Certificate (UEC) with at least 3 Grade Bs, or a Sijil Kemahiran Malaysia (SKM) Level 3\/Sijil Vokasional Malaysia (SVM), with screening and guidance from the Higher Education Provider (HEP). Alternatively, a Certificate (Level 3 Malaysian Qualifications Framework) in a relevant field with a CGPA of 2.00 or higher, or a Sijil Tinggi Persekolahan Malaysia (STPM) with at least Grade C (2.00 CGPA) in any subject, or a Sijil Tinggi Agama Malaysia (STAM) with Grade Maqbul, or other equivalent qualifications recognized by the Malaysian Government may also be accepted. Additionally, applicants must pass an interview (online, virtual, or conventional) or submit a portfolio as required by the HEP. International students must also achieve a minimum High Band 2 in the Malaysian University English Test (MUET) or its equivalent, such as CEFR Mid B1.",
        "Career Prospects":" UI\/UX Designer, 3D Visualizer, Web Designer, Design Educator, Digital Illustrator, Creative Director, Creative Consultant, 2D & 3D Animator, Multimedia Designer, Video Game Designer, Advertising Art Director, Digital Media Photographer, Entrepreneur, Digital Developer, Website User Experience Designer, Video Production Executive, and Digital Media Specialist.",
        "Y1 module":"students will be introduced to the key aspects of design history, theory, technical skills, and design thinking in digital media design. They will also engage in weekly technical demonstrations and practical workshops to enhance their digital skills. Core modules include Contextual Studies, History of Art & Design, Colour Studies, 2 & 3 Dimensional Designs, Drawing, Digital Media Design Fundamentals, Introduction to Multimedia, Storyboard Design & Visual Narrative, Typography, Technical Skills, Computer Graphics 1 and 2, Digital Photography, and 2D Digital Animation.",
        "Y2 module":"students will start thinking more professionally about digital media and have opportunities to enhance their skills and knowledge. They will explore design principles, theories, and engage in research. Students will also focus on working practices related to audio-visual techniques, creative media design, and media production. Core modules include Contextual Studies, Introduction to UX Design, Introduction to Game Design, Media Technology, Interactive Media Design, Digital Video Production, 3D Game Design, Digital Design Exploration, Digital Illustration, 3D Visualization, Motion Graphics, 3D Animation, Web Design, and Visual Communication.",
        "Y3 module":"students will refine their creativity and focus on their professional interests, aiming to develop dynamic design solutions and create a distinctive, industry-ready portfolio. Core modules include Professional Development, Industrial Practice, Entrepreneurship of Digital Design, Personal Portfolio Development, and the Digital Media Design Final Project.",
        "Unnamed: 10":" "
    },
    {
        "Course":"Diploma in Accounting",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":26800,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Accounts executive, Audit Assistant, Tax Assistant",
        "Y1 module":"The core modules include Financial Accounting, Financial Report Analysis, Computerized Accounting, Cost Accounting, Management Accounting, Taxation, Auditing, Finance, Microeconomics, Macroeconomics, Principles of Business Management, Principles of Marketing, Business Law, Business Mathematics, Business Statistics, Computer Applications, Foundation in Information Systems, Entrepreneurship, and English I, II, III, and IV.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Teaching Chinese as a Second Language",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":25200,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":null,
        "Y1 module":"The core modules include Educational Psychology, Foundation of Teaching Chinese as a Second Language, Principles of Education, Audiolingualism of Teaching Chinese as a Second Language, Studies of Phonetic Instruction in Chinese, Chinese Pedagogical Grammar, Chinese Social and Culture, Teaching Reading to Students of Chinese as a Second Language, Modern Chinese Language, Second Language Acquisition, Foundation of Chinese Linguistics, Chinese Ancient Literature, Chinese Philology, Cross-Cultural Communication, Chinese Language Teaching Plan, Teaching Writing to Students of Chinese as a Second Language, Assessments for Chinese Language Teaching, Bilingual Education, Development of Chinese Education in Southeast Asia, Modern Chinese Literature, Classroom and Behaviour Management, and Practicum.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Early Childhood Education",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.25,
        "Course Fee(RM)":24700,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"qualified early childhood educators recognized locally and internationally, qualified principals of early childhood care centres, operators and managers of early childhood care centres, nursery and day care centres, and professionals involved in planning and designing early childhood education curricula.",
        "Y1 module":"The programme modules include Educational Psychology, Introduction to Infant and Child Care, Child Development and Care, Classroom and Behaviour Management, Children Psychology, Early Childhood Curriculum Approaches, Science and Computer Education for Young Children, Mathematics for Young Children, Teaching Introduction to Early Childhood Education, Play and Learning, Teaching Language for Young Children, Observation and Assessment of Young Children, Parenting Education, Professional Ethics for Early Childhood Educators, Multi-Cultural Education, Music and Drama for Young Children, Art and Craft for Young Children, Early Childhood Administration, Children’s Creativity, Special Educational Needs and Learning Disabilities, Child’s Meal and Nutrition, Practicum (Childcare Centre), and Practicum (Preschool\/Kindergarten).",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Media Studies",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":25200,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 5 passes(including chinese) OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Graduates with cross-media production skills, creative thinking, and professional communication literacy can pursue a wide range of careers in online media, social media, television, radio, newspapers, magazines, publishing, video production, public relations, advertising, marketing, as well as in the cultural and educational sectors, with roles including news reporter, editor, news anchor, content creator, photographer, video editor, program producer, social media manager, copywriter, public relations specialist, brand marketing expert, media analyst, researcher, and translator, offering extensive opportunities in the digital age.",
        "Y1 module":"Media Communication, Journalism, Chinese News Writing, Newspaper and Magazine Editing, Environmental Reporting, Digital News Production, Newspaper Publication and Production, Introduction to Mass Communication, Political Science, Domestic and International Current Affairs Analysis, Theory and Practice of Translation, Media Law and Ethics, Communication and Computer Applications, Digital Media, Digital Photography, Digital Image Processing, Digital Visual Production and Editing, Digital Editing and Design, Mandarin Phonetics, Production and Hosting of Radio Programmes, Public Relations, Public Relations Media Application, Marketing, Principles of Advertising, Crisis Management, and Public Relations Campaign Planning.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Performing Arts",
        "Degree":"Diploma",
        "Semester":7,
        "Duration(Year)":2.5,
        "Course Fee(RM)":30200,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":null,
        "Y1 module":"Practical Skills (Film & TV, Theatre), Introduction to Digital Filmmaking, Advanced Digital Filmmaking, Visual Editing, Documentary Production, Professional Apprenticeship, Graduation Production, Career Management, Fundamentals of Acting, Performance Practice, Mandarin Phonetics, Voice Acting, Basics of Theatre Production, Elements of Theatre Production, Playwriting, Introduction to Directing, Sound Design, Lighting Design, Set Design, Costume and Make-Up, Children’s Creative Drama Teaching, Theory and Aesthetic Literacy, Introduction to Film and Video, History of Cinema, History of Theatre, Introduction to Drama, Principles of Arts Management, Appreciation and Analysis of Script, Art Appreciation, Art and Society, Special Topic on Film, and Malaysian Traditional Theatre.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Business Administration",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":25700,
        "Min Entry Requirement":"SPM with 3 Credits OR UEC with 3 Credits OR O Level \/ IGCSE \/ Other qualifications deemed equivalent by MQA",
        "Career Prospects":"Career options include Human Resource Executive, Office Manager, Team Leader, Retail Manager, Program Coordinator, Entrepreneurs\/Business Owner, Unit Manager, and Business Development Manager.",
        "Y1 module":"The programme modules include Business Mathematics, Macroeconomics, Introduction to Web Design, Creative Thinking & Innovation, English for Diploma Studies, Computer Applications, Financial Accounting, Business Statistics, Microeconomics, Business Ethics, Foundations of Information Systems, E-Commerce, Human Resource Management, Advanced English for Diploma Studies, Business Law, Business Communications, Financial Management, Accounting for Decision Making, Consumer Behaviour, Principles of Business Management, Computerized Accounting, Principles of Marketing, Intermediate English for Diploma Studies, Financial Planning, International Business, Entrepreneurship, Cost and Management Accounting, and Computerized Human Resource Management.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploma in Information Technology",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":26200,
        "Min Entry Requirement":"Candidates must possess SPM with at least three (3) credits in any subject, including Mathematics, or any equivalent qualification; UEC with at least three (3) credits in any subject, including Mathematics, or any equivalent qualification; Sijil Kemahiran Malaysia (SKM) Level 3 in IT fields; a Certificate (Level 3, MQF) in a related field with a minimum CGPA of 2.00; O Level \/ IGCSE \/ other qualifications deemed equivalent by MQA (subject to Senate\/Academic Board approval); or candidates with a pass in Mathematics at SPM level or its equivalent may be admitted if their admission qualifications contain subjects in Mathematics equivalent to SPM-level Mathematics.",
        "Career Prospects":"Network Administrator, System Administrator, IT Support Technician, Web Developer, Database Administrator, Software Developer, or in IT Sales and Marketing.",
        "Y1 module":"Mathematics, Programming Concepts, IT Ethics, Introduction to Operating Systems, Networking, Web Design, PC Maintenance, Database Concepts, Introduction to Statistics, Introduction to Android Programming, GUI Using JAVA, Security in Computing, Introduction to Cloud Computing, System Analysis & Design, Discrete Mathematics, and Advanced Mathematics.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    },
    {
        "Course":"Diploms in Computer Science",
        "Degree":"Diploma",
        "Semester":6,
        "Duration(Year)":2.0,
        "Course Fee(RM)":26200,
        "Min Entry Requirement":"Candidates must possess SPM with at least three (3) credits in any subject, including Mathematics, or any equivalent qualification; UEC with at least three (3) credits in any subject, including Mathematics, or any equivalent qualification; O Level \/ IGCSE \/ other qualifications deemed equivalent by MQA (subject to Senate\/Academic Board approval); or candidates with a pass in Mathematics at SPM level or its equivalent may be admitted if their admission qualifications contain subjects in Mathematics equivalent to SPM-level Mathematics.",
        "Career Prospects":"Computer Programme Analyst, Computer Programmer, Computer System and Technology Developer, Software Engineer, System Analyst, Network Administrator, or Multimedia Designer.",
        "Y1 module":"Mathematics, Programming Concepts, IT Ethics, Introduction to Operating Systems, Networking, Web Design, Architecture and Organization, PC Maintenance, Database Concepts, Introduction to Statistics, Introduction to Python Programming, Intelligent Systems, GUI Using JAVA, Security in Computing, Algorithm and Data Structure, System Analysis & Design, Discrete Mathematics, Advanced Mathematics, Introduction to Android Programming, Project, and Industrial Training.",
        "Y2 module":null,
        "Y3 module":null,
        "Unnamed: 10":null
    }
]